chronoweb/src/main/resources/webroot/example/subscribe/GetStandardVersion/GetStandardVersion.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:query="urn:epcglobal:epcis-query:xsd:1">
    <soapenv:Header/>
    <soapenv:Body>
        <query:GetStandardVersion/>
    </soapenv:Body>
</soapenv:Envelope>