example/query/Poll_event_single_param_advanced/EXISTS_INNER_ILMD_fieldname.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:query="urn:epcglobal:epcis-query:xsd:1" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <query:Poll>
            <queryName>SimpleEventQuery</queryName>
            <params>
                <param>
                    <name>EXISTS_INNER_ILMD_http://ext.com/ext2#string</name>
                    <value xsi:type="query:VoidHolder"/>
                </param>
            </params>
        </query:Poll>
    </soapenv:Body>
</soapenv:Envelope>

