example/query/Poll_event_single_param_basic/MATCH_inputEPC.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:query="urn:epcglobal:epcis-query:xsd:1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <query:Poll>
            <queryName>SimpleEventQuery</queryName>
            <params>
                <param>
                    <name>MATCH_inputEPC</name>
                    <value xsi:type="query:ArrayOfString">
                        <string>urn:epc:id:sgtin:4012345.011122.25</string>
                        <string>urn:epc:id:sgtin:4000001.065432.99886655</string>
                    </value>
                </param>
            </params>
        </query:Poll>
    </soapenv:Body>
</soapenv:Envelope>